<a href="https://colab.research.google.com/github/HugoAlmeida08/Data-Science/blob/main/Cria%C3%A7%C3%A3o_de_s%C3%A9ries_e_DF.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

Criando e formatando series a partir de uma lista

In [ ]:
data = [1,2,3,4,5]

In [ ]:
s = pd.Series()

In [ ]:
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [ ]:
index = ['Linha' + str(i) for i in range(5)]

In [ ]:
index

['Linha0', 'Linha1', 'Linha2', 'Linha3', 'Linha4']

In [ ]:
s = pd.Series(data = data, index = index)

In [ ]:
s

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

In [ ]:
data = {'Linha' + str(i) : i + 1 for i in range(5)}

In [ ]:
data

{'Linha0': 1, 'Linha1': 2, 'Linha2': 3, 'Linha3': 4, 'Linha4': 5}

In [ ]:
s = pd.Series(data)

In [ ]:
s

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

In [ ]:
s1 = s + 2

In [ ]:
s1

Linha0    3
Linha1    4
Linha2    5
Linha3    6
Linha4    7
dtype: int64

In [ ]:
s2 = s + s1

In [ ]:
s2

Linha0     4
Linha1     6
Linha2     8
Linha3    10
Linha4    12
dtype: int64

##Criando e formatando DataFrames

Lista

In [ ]:
data = [[ 1, 2, 3], [ 4, 5, 6], [ 7, 8, 9]]

In [ ]:
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [ ]:
df1 = pd.DataFrame(data = data)

In [ ]:
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [ ]:
index = ['Linha' + str(i) for i in range(3)]

In [ ]:
index

['Linha0', 'Linha1', 'Linha2']

In [ ]:
df1 = pd.DataFrame(data = data, index = index)

In [ ]:
df1

        0  1  2
Linha0  1  2  3
Linha1  4  5  6
Linha2  7  8  9

In [ ]:
columns = ['Coluna' + str(i) for i in range(3)]

In [ ]:
df1 = pd.DataFrame(data = data, index = index, columns = columns)

In [ ]:
df1

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

Dicionário

In [ ]:
data = {'Coluna 0' : {'Linha0' : 1, 'Linha1' : 4, 'Linha2': 7},
        'Coluna 1' : {'Linha0' : 2, 'Linha1' : 5, 'Linha2': 8},
        'Coluna 2' : {'Linha0' : 3, 'Linha1' : 6, 'Linha2': 9}}

In [ ]:
data

{'Coluna 0': {'Linha0': 1, 'Linha1': 4, 'Linha2': 7},
 'Coluna 1': {'Linha0': 2, 'Linha1': 5, 'Linha2': 8},
 'Coluna 2': {'Linha0': 3, 'Linha1': 6, 'Linha2': 9}}

In [ ]:
df2 = pd.DataFrame(data)

In [ ]:
df2

        Coluna 0  Coluna 1  Coluna 2
Linha0         1         2         3
Linha1         4         5         6
Linha2         7         8         9

Conjunto de tuplas

In [ ]:
data = [( 1, 2, 3),
        ( 4, 5, 6),
        ( 7, 8, 9)]

In [ ]:
data

[(1, 2, 3), (4, 5, 6), (7, 8, 9)]

In [ ]:
df3 = pd.DataFrame(data =data, index = index, columns = columns)

In [ ]:
 df3

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [ ]:
df1[df1 > 0] = 'A'

In [ ]:
df1

       Coluna0 Coluna1 Coluna2
Linha0       A       A       A
Linha1       A       A       A
Linha2       A       A       A

In [ ]:
df2[df2 > 0] = 'B'

In [ ]:
df2

       Coluna 0 Coluna 1 Coluna 2
Linha0        B        B        B
Linha1        B        B        B
Linha2        B        B        B

In [ ]:
df3[df3 > 0] = 'C'

In [ ]:
df3

       Coluna0 Coluna1 Coluna2
Linha0       C       C       C
Linha1       C       C       C
Linha2       C       C       C

In [ ]:
df4 = pd.concat([df1, df2, df3], )

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

In [ ]:
df4

       Coluna 0 Coluna 1 Coluna 2 Coluna0 Coluna1 Coluna2
Linha0      NaN      NaN      NaN       A       A       A
Linha1      NaN      NaN      NaN       A       A       A
Linha2      NaN      NaN      NaN       A       A       A
Linha0        B        B        B     NaN     NaN     NaN
Linha1        B        B        B     NaN     NaN     NaN
Linha2        B        B        B     NaN     NaN     NaN
Linha0      NaN      NaN      NaN       C       C       C
Linha1      NaN      NaN      NaN       C       C       C
Linha2      NaN      NaN      NaN       C       C       C

In [ ]:

dados = [('A', 'B'), ('C', 'D')]
df = pd.DataFrame(dados, columns = ['L1', 'L2'],  index = ['C1', 'C2'])
df

   L1 L2
C1  A  B
C2  C  D

#Organizando dataframes(sort)

In [ ]:
data = [[1 ,2 ,3], [4, 5, 6], [7, 8, 9]]

In [ ]:
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [ ]:
list('321')

['3', '2', '1']

In [ ]:
df = pd.DataFrame(data, list('321'), list ('ZYX'))

In [ ]:
df

   Z  Y  X
3  1  2  3
2  4  5  6
1  7  8  9

In [ ]:
df.sort_index(inplace = True)

In [ ]:
df

   Z  Y  X
1  7  8  9
2  4  5  6
3  1  2  3

In [ ]:
df.sort_index(inplace = True, axis = 1)

In [ ]:
df

   X  Y  Z
1  9  8  7
2  6  5  4
3  3  2  1

In [ ]:
df.sort_values(by = ['X', 'Y'], inplace = True)

In [ ]:
df

   Z  Y  X
3  1  2  3
2  4  5  6
1  7  8  9

In [ ]:
df.sort_values(by = '3', axis = 1, inplace = True)

In [ ]:
df

   Z  Y  X
3  1  2  3
2  4  5  6
1  7  8  9

Formas de seleção

In [ ]:
import pandas as pd

In [ ]:
data = [(1, 2, 3, 4),
        (5, 6, 7, 8),
        (9, 10, 11, 12),
        (13, 14, 15, 16)]
df = pd.DataFrame(data, 'l1 l2 l3 l4'.split(), 'c1 c2 c3 c4'.split())

In [ ]:
df

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   9  10  11  12
l4  13  14  15  16

In [ ]:
df['c1']

l1     1
l2     5
l3     9
l4    13
Name: c1, dtype: int64

In [ ]:
type(df['c1'])

pandas.core.series.Series

In [ ]:
df[['c3', 'c1']]

    c3  c1
l1   3   1
l2   7   5
l3  11   9
l4  15  13

In [ ]:
df[1:]

    c1  c2  c3  c4
l2   5   6   7   8
l3   9  10  11  12
l4  13  14  15  16

In [ ]:
df[1:3]

    c1  c2  c3  c4
l2   5   6   7   8
l3   9  10  11  12

In [ ]:
 df[1:2]

    c1  c2  c3  c4
l2   5   6   7   8

In [ ]:
df[1:1]

Empty DataFrame
Columns: [c1, c2, c3, c4]
Index: []

In [ ]:
df[1:][['c3', 'c1']]

    c3  c1
l2   7   5
l3  11   9
l4  15  13

In [ ]:
df.loc['l3']

c1     9
c2    10
c3    11
c4    12
Name: l3, dtype: int64

In [ ]:
df.loc[['l3', 'l2']]

    c1  c2  c3  c4
l3   9  10  11  12
l2   5   6   7   8

In [ ]:
df.loc['l1', 'c2']

2

In [ ]:
df.iloc[0, 1]

2

In [ ]:
df.loc[['l3', 'l1'], ['c4', 'c1']]

    c4  c1
l3  12   9
l1   4   1

In [ ]:
df

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   9  10  11  12
l4  13  14  15  16